import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'ngx-static-details',
  templateUrl: './static-details.component.html',
  styleUrls: ['./static-details.component.scss']
})
export class StaticDetailsComponent implements OnInit {

  data = `
  <p>الشروط والأحكام العامة: مبادرة&quot; صندوق الغشيان الخيري&quot; هو تطبيق موبايل IOS و Androidتم إنشاؤه في نهاية عام 2019 م وتم البدء بتطبيقه في مارس عام 2020م و تهدف هذه المبادرة إلى إتاحة الفرصة لكل فرد من أفراد أسرة آل غشيان المساهمة في دعم من يحتاج من الأسرة إلى خدمات هذا الصندوق تحقيقاً لمفهوم التكافل الأسري.<br />
ويملك هذا البرنامج ويديره أبناء وبنات عائلة الغشيان أو من يتم اختياره من أقارب العائلة ويهدف إلى :<br />
تقديم خدمة أسرية لتحقيق مفهوم التكافل الأسري. إنشاء قاعدة بيانات تشمل أسماء المتبرعين والمبالغ المتبرع بها والمستفيدين من الصندوق والمبالغ المصروفة لهم. وتقوم فكرة الصندوق على التبرع الشهري من أبناء وبنات الأسرة بحسب رغبتهم أو قبول التبرعات وزكاة الأموال من أفراد العائلة أيضاً ويشرف على الصندوق لجنة اعضاؤها من أفراد الأسرة أنفسهم،<br />
ويتم التعامل مع جميع البيانات التي ستوثق في القاعدة بسرية تامة ولا يطَلع عليها إلا العضو نفسه ولجنة الصندوق المخولة بذلك ، ويتم اختيار أعضاء اللجنة وفق ترشيح من قبل كبار وممثلي العائلة من الرجال والنساء بحد أقصى 5 أعضاء،<br />
ويجب استخدامه وفقا للشروط والأحكام المذكورة أدناه لذا على مستخدمي هذا التطبيق الالتزام بالتالي:<br />
قراءة هذه الشروط والأحكام العامة بعناية قبل الاستخدام. طباعة نسخة منها للرجوع إليها في المستقبل التسجيل:<br />
للمشاركة، عليك بالتسجيل عن طريق ملء نماذج التسجيل الموجودة على التطبيق، والموافقة على جميع الأحكام والشروط بإنشاء حساب.<br />
عند التسجيل، سوف يطلب منك أن تقدم لنا البيانات الشخصية وأنت وحدك المسؤول عن معلومات الدخول الخاصة بك وستتم معالجة البيانات الشخصية الخاصة بك بسرية تامة ولن تستخدم لأي غرض آخر . قواعد السلوك: يقوم هذا التطبيق على الشراكة بين أعضائه ولا يتم دفع رسوم لاستخدامه كما أنه لا يرتبط بأي تعاملات تجارية أخرى غير الغرض الذي أنشئ من أجله.<br />
يسمح التطبيق بنشر أخبار العائلة ويمكنك ارسال ما تريد نشره إلى الشخص المخول بذلك من أعضاء اللجنة، كما يسمح التطبيق بادراج مواعيد المناسبات ومقرها وتسجيل رغبتكم حيالها. لا يسمح التطبيق لأي شخص بتحميل أي محتوى فيه كما لا يمكنك ادراج صور أو ملفات دون أخذ الموافقة من عضو اللجنة المختص. تحتفظ اللجنة بحق رفض أو حجب أو إزالة أي مستخدم ليس له علاقة بأسرة آل غشيان. يمكن لأي عضو من أفراد الأسرة الاطلاع على التقارير السنوية في حال رغب بذلك. الخدمات الرئيسية للتطبيق - MAJOR FEATURES ينقسم إلى أربعة أجزاء: الجزء الأول خاص بقاعدة بيانات المتبرعين والمتبرعات يتضمن : البيانات الأساسية ( الإسم ، الجنس، رقم الهوية ، اسم البنك ، رقم الحساب ) خيارات التبرع (دعم شهري أو مبلغ زكاة أو الخيارات الأخرى الموجودة في التطبيق).<br />
خدمة اشعار برسالة نصية كل شهر للتذكير بالايداع الشهري. تقرير بعدد العمليات( إجمالي وفردي) التي تمت المساهمة فيها عبر التطبيق. تقرير أوجه الصرف (بدون أسماء مستفيدين). الجزء الثاني خاص بطلب الدعم أو الخدمة من خلال نموذج طلب عون أو خدمة يتم تعبئته من صاحب الحاجة يتضمن التالي:<br />
البيانات الأساسية ( الاسم ، الجنس، الحالة الاجتماعية متزوج أو أعزب، إذا متزوج هل لديه أطفال و كم عددهم، يعمل أو لا يعمل و اذا يعمل في قطاع حكومي أو خاص ،لديه سكن ملك أو مستأجر ، دخله الشهري، تحديد الالتزامات المادية عليه دين أو لا، عدد المعالين &ndash; أولاد &ndash; أباء ...إلخ) عدد مرات الاستفادة من الصندوق ( صفر &ndash; 1 &ndash; 2- 3 &ndash; 4 أكثر من ذلك). مجال الخدمة أو الدعم المطلوب للمساعدة في (الزواج &ndash; للمرة الأولى أو الثانية-، إيجار منزل ، دفع دين ، مصاريف علاجية، مصاريف معيشية ، مصاريف دراسية، فواتير، شراء سيارة ، شراء أجهزة منزلية.....) المبلغ المطلوب (.....................) طلب قرض من الصندوق ( أسباب القرض، مدة القرض ، الدخل الشهري للمقترض، المبلغ المطلوب اقتراضه، طريقة سداد القرض للصندوق( تسديد شهري، ربع سنوي، نصف سنوي )، طلب تأجيل دفعة). حالة الطلب. الجزء الثالث خاص بأعضاء اللجنة حيث يتم تحديد أعضاء لجنة للصندوق يتراوح عددهم من ( 3 &ndash; 5 ) أعضاء بحيث يصلهم نماذج طلب الدعم أو الخدمة ويتم دراستها واتخاذ القرار حيالها كل عضو على حدة وفق معايير محددة. وعند الرفض يتم توضيح أسباب ذلك ثم تفرز القرارات وتظهر النتيجة النهائية بقبول الطلب أو رفضه ،<br />
وترسل إلى المحاسب المالي الذي يتم رفع طلب للبنك بتحويل المبلغ للمستفيد ويمكن تأجيل الدفع في حال عدم وجود مبلغ كافي . الجزء الرابع التقارير المالية للايرادات والمصروفات وهي خاصة بأعضاء اللجنة موضح بها الآتي: أسماء وأعداد المتبرعين شهرياً والمبالغ المتبرع بها. أعداد المستفيدين من الصندوق والمبالغ المنصرفة وفي كل نوع. أعداد الطلبات التي لم يتم تنفيذها لعدم وجود رصيد كافي في الصندوق. أعداد الطلبات التي لم تتم الموافقة عليها لعدم انطباق الشروط والمعايير عليها. أعداد الطلبات المتعثرة بالسداد والأسباب. حقوق الملكية الفكرية:<br />
يوافق المستخدم على احترام حقوق الملكية الفكرية والحقوق الشخصية للآخرين والامتناع عن نشر أي محتوى على التطبيق ويعتبر التطبيق ملك لأسرة آل غشيان فقط. طلبات عبر تواصل معنا: يمكن للمستخدمين أيضا ارسال استفساراتهم أو طلبات أخرى عبر ارسال بريد إلكتروني إلى................................................................................. وينبغي أن يتضمن هذا البريد المعلومات التالية: (أ) اسم وهاتف المرسل؛  (ب) الطلب أو الاستفسار: (ج) المبررات ؛</p>

  `
  constructor() { }

  ngOnInit() {
  }

}
